Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Service/CpuGeneric/SysSe/Math/Ifx_LutAtan2F32_Table.c
/**
 * \file Ifx_LutAtan2F32_Table.c
 * \brief Table data for ATAN2 lookup functions
 *
 *
 * \version disabled
 * \copyright Copyright (c) 2013 Infineon Technologies AG. All rights reserved.
 *
 *
 *                                 IMPORTANT NOTICE
 *
 * Use of this file is subject to the terms of use agreed between (i) you or
 * the company in which ordinary course of business you are acting and (ii)
 * Infineon Technologies AG or its licensees. If and as long as no such terms
 * of use are agreed, use of this file is subject to following:
 *
 * Boost Software License - Version 1.0 - August 17th, 2003
 *
 * Permission is hereby granted, free of charge, to any person or organization
 * obtaining a copy of the software and accompanying documentation covered by
 * this license (the "Software") to use, reproduce, display, distribute,
 * execute, and transmit the Software, and to prepare derivative works of the
 * Software, and to permit third-parties to whom the Software is furnished to
 * do so, all subject to the following:
 *
 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 */

#include "Ifx_LutAtan2F32.h"

#if IFX_LUT_TABLE_CONST == 0
/* FIXME Table size and type  not consistent  */
sint16 Ifx_g_LutAtan2F32_FxpAngle_table[IFX_LUTATAN2F32_SIZE];
#else

#if (IFX_LUTATAN2F32_SIZE != 1024)
#error "Inconsistent between Lookup Table and configuration. Please regenerate."
#endif

const Ifx_Lut_FxpAngle Ifx_g_LutAtan2F32_FxpAngle_table[1024 + 1] = {
    IFX_LUT_F32_TO_FXPANGLE(0),
    IFX_LUT_F32_TO_FXPANGLE(0.000976562189559319f),
    IFX_LUT_F32_TO_FXPANGLE(0.00195312251647882f),
    IFX_LUT_F32_TO_FXPANGLE(0.00292967911813999f),
    IFX_LUT_F32_TO_FXPANGLE(0.00390623013196697f),
    IFX_LUT_F32_TO_FXPANGLE(0.00488277369544783f),
    IFX_LUT_F32_TO_FXPANGLE(0.00585930794615589f),
    IFX_LUT_F32_TO_FXPANGLE(0.00683583102177106f),
    IFX_LUT_F32_TO_FXPANGLE(0.00781234106010111f),
    IFX_LUT_F32_TO_FXPANGLE(0.008788836199103f),
    IFX_LUT_F32_TO_FXPANGLE(0.00976531457690415f),
    IFX_LUT_F32_TO_FXPANGLE(0.0107417743318238f),
    IFX_LUT_F32_TO_FXPANGLE(0.0117182136023941f),
    IFX_LUT_F32_TO_FXPANGLE(0.0126946305273818f),
    IFX_LUT_F32_TO_FXPANGLE(0.0136710232458091f),
    IFX_LUT_F32_TO_FXPANGLE(0.014647389896975f),
    IFX_LUT_F32_TO_FXPANGLE(0.0156237286204768f),
    IFX_LUT_F32_TO_FXPANGLE(0.0166000375562313f),
    IFX_LUT_F32_TO_FXPANGLE(0.0175763148444956f),
    IFX_LUT_F32_TO_FXPANGLE(0.018552558625889f),
    IFX_LUT_F32_TO_FXPANGLE(0.0195287670414137f),
    IFX_LUT_F32_TO_FXPANGLE(0.0205049382324764f),
    IFX_LUT_F32_TO_FXPANGLE(0.0214810703409091f),
    IFX_LUT_F32_TO_FXPANGLE(0.0224571615089906f),
    IFX_LUT_F32_TO_FXPANGLE(0.0234332098794676f),
    IFX_LUT_F32_TO_FXPANGLE(0.0244092135955758f),
    IFX_LUT_F32_TO_FXPANGLE(0.0253851708010611f),
    IFX_LUT_F32_TO_FXPANGLE(0.0263610796402008f),
    IFX_LUT_F32_TO_FXPANGLE(0.0273369382578244f),
    IFX_LUT_F32_TO_FXPANGLE(0.0283127447993352f),
    IFX_LUT_F32_TO_FXPANGLE(0.029288497410731f),
    IFX_LUT_F32_TO_FXPANGLE(0.0302641942386252f),
    IFX_LUT_F32_TO_FXPANGLE(0.0312398334302683f),
    IFX_LUT_F32_TO_FXPANGLE(0.0322154131335681f),
    IFX_LUT_F32_TO_FXPANGLE(0.0331909314971116f),
    IFX_LUT_F32_TO_FXPANGLE(0.0341663866701854f),
    IFX_LUT_F32_TO_FXPANGLE(0.0351417768027968f),
    IFX_LUT_F32_TO_FXPANGLE(0.036117100045695f),
    IFX_LUT_F32_TO_FXPANGLE(0.0370923545503918f),
    IFX_LUT_F32_TO_FXPANGLE(0.0380675384691825f),
    IFX_LUT_F32_TO_FXPANGLE(0.039042649955167f),
    IFX_LUT_F32_TO_FXPANGLE(0.0400176871622703f),
    IFX_LUT_F32_TO_FXPANGLE(0.0409926482452638f),
    IFX_LUT_F32_TO_FXPANGLE(0.0419675313597857f),
    IFX_LUT_F32_TO_FXPANGLE(0.0429423346623622f),
    IFX_LUT_F32_TO_FXPANGLE(0.0439170563104278f),
    IFX_LUT_F32_TO_FXPANGLE(0.0448916944623465f),
    IFX_LUT_F32_TO_FXPANGLE(0.0458662472774322f),
    IFX_LUT_F32_TO_FXPANGLE(0.0468407129159697f),
    IFX_LUT_F32_TO_FXPANGLE(0.0478150895392348f),
    IFX_LUT_F32_TO_FXPANGLE(0.0487893753095156f),
    IFX_LUT_F32_TO_FXPANGLE(0.0497635683901328f),
    IFX_LUT_F32_TO_FXPANGLE(0.0507376669454602f),
    IFX_LUT_F32_TO_FXPANGLE(0.0517116691409454f),
    IFX_LUT_F32_TO_FXPANGLE(0.05268557314313f),
    IFX_LUT_F32_TO_FXPANGLE(0.0536593771196708f),
    IFX_LUT_F32_TO_FXPANGLE(0.0546330792393595f),
    IFX_LUT_F32_TO_FXPANGLE(0.0556066776721433f),
    IFX_LUT_F32_TO_FXPANGLE(0.0565801705891457f),
    IFX_LUT_F32_TO_FXPANGLE(0.0575535561626864f),
    IFX_LUT_F32_TO_FXPANGLE(0.0585268325663018f),
    IFX_LUT_F32_TO_FXPANGLE(0.0594999979747652f),
    IFX_LUT_F32_TO_FXPANGLE(0.0604730505641073f),
    IFX_LUT_F32_TO_FXPANGLE(0.0614459885116361f),
    IFX_LUT_F32_TO_FXPANGLE(0.0624188099959574f),
    IFX_LUT_F32_TO_FXPANGLE(0.0633915131969944f),
    IFX_LUT_F32_TO_FXPANGLE(0.0643640962960086f),
    IFX_LUT_F32_TO_FXPANGLE(0.0653365574756192f),
    IFX_LUT_F32_TO_FXPANGLE(0.0663088949198235f),
    IFX_LUT_F32_TO_FXPANGLE(0.0672811068140167f),
    IFX_LUT_F32_TO_FXPANGLE(0.068253191345012f),
    IFX_LUT_F32_TO_FXPANGLE(0.0692251467010603f),
    IFX_LUT_F32_TO_FXPANGLE(0.0701969710718705f),
    IFX_LUT_F32_TO_FXPANGLE(0.0711686626486288f),
    IFX_LUT_F32_TO_FXPANGLE(0.0721402196240188f),
    IFX_LUT_F32_TO_FXPANGLE(0.0731116401922413f),
    IFX_LUT_F32_TO_FXPANGLE(0.0740829225490337f),
    IFX_LUT_F32_TO_FXPANGLE(0.0750540648916902f),
    IFX_LUT_F32_TO_FXPANGLE(0.0760250654190807f),
    IFX_LUT_F32_TO_FXPANGLE(0.0769959223316711f),
    IFX_LUT_F32_TO_FXPANGLE(0.0779666338315423f),
    IFX_LUT_F32_TO_FXPANGLE(0.07893719812241f),
    IFX_LUT_F32_TO_FXPANGLE(0.0799076134096439f),
    IFX_LUT_F32_TO_FXPANGLE(0.0808778779002873f),
    IFX_LUT_F32_TO_FXPANGLE(0.0818479898030765f),
    IFX_LUT_F32_TO_FXPANGLE(0.0828179473284599f),
    IFX_LUT_F32_TO_FXPANGLE(0.0837877486886171f),
    IFX_LUT_F32_TO_FXPANGLE(0.0847573920974787f),
    IFX_LUT_F32_TO_FXPANGLE(0.0857268757707448f),
    IFX_LUT_F32_TO_FXPANGLE(0.0866961979259047f),
    IFX_LUT_F32_TO_FXPANGLE(0.0876653567822554f),
    IFX_LUT_F32_TO_FXPANGLE(0.0886343505609211f),
    IFX_LUT_F32_TO_FXPANGLE(0.0896031774848717f),
    IFX_LUT_F32_TO_FXPANGLE(0.0905718357789422f),
    IFX_LUT_F32_TO_FXPANGLE(0.0915403236698511f),
    IFX_LUT_F32_TO_FXPANGLE(0.0925086393862194f),
    IFX_LUT_F32_TO_FXPANGLE(0.0934767811585895f),
    IFX_LUT_F32_TO_FXPANGLE(0.0944447472194436f),
    IFX_LUT_F32_TO_FXPANGLE(0.0954125358032227f),
    IFX_LUT_F32_TO_FXPANGLE(0.0963801451463448f),
    IFX_LUT_F32_TO_FXPANGLE(0.0973475734872237f),
    IFX_LUT_F32_TO_FXPANGLE(0.0983148190662873f),
    IFX_LUT_F32_TO_FXPANGLE(0.0992818801259964f),
    IFX_LUT_F32_TO_FXPANGLE(0.100248754910863f),
    IFX_LUT_F32_TO_FXPANGLE(0.101215441667467f),
    IFX_LUT_F32_TO_FXPANGLE(0.102181938644477f),
    IFX_LUT_F32_TO_FXPANGLE(0.103148244092669f),
    IFX_LUT_F32_TO_FXPANGLE(0.10411435626494f),
    IFX_LUT_F32_TO_FXPANGLE(0.10508027341633f),
    IFX_LUT_F32_TO_FXPANGLE(0.106045993804039f),
    IFX_LUT_F32_TO_FXPANGLE(0.107011515687447f),
    IFX_LUT_F32_TO_FXPANGLE(0.107976837328126f),
    IFX_LUT_F32_TO_FXPANGLE(0.108941956989866f),
    IFX_LUT_F32_TO_FXPANGLE(0.109906872938685f),
    IFX_LUT_F32_TO_FXPANGLE(0.110871583442852f),
    IFX_LUT_F32_TO_FXPANGLE(0.111836086772904f),
    IFX_LUT_F32_TO_FXPANGLE(0.112800381201659f),
    IFX_LUT_F32_TO_FXPANGLE(0.113764465004242f),
    IFX_LUT_F32_TO_FXPANGLE(0.114728336458092f),
    IFX_LUT_F32_TO_FXPANGLE(0.115691993842991f),
    IFX_LUT_F32_TO_FXPANGLE(0.116655435441069f),
    IFX_LUT_F32_TO_FXPANGLE(0.117618659536834f),
    IFX_LUT_F32_TO_FXPANGLE(0.118581664417177f),
    IFX_LUT_F32_TO_FXPANGLE(0.1195444483714f),
    IFX_LUT_F32_TO_FXPANGLE(0.120507009691225f),
    IFX_LUT_F32_TO_FXPANGLE(0.121469346670814f),
    IFX_LUT_F32_TO_FXPANGLE(0.122431457606789f),
    IFX_LUT_F32_TO_FXPANGLE(0.123393340798243f),
    IFX_LUT_F32_TO_FXPANGLE(0.124354994546761f),
    IFX_LUT_F32_TO_FXPANGLE(0.125316417156437f),
    IFX_LUT_F32_TO_FXPANGLE(0.126277606933887f),
    IFX_LUT_F32_TO_FXPANGLE(0.127238562188269f),
    IFX_LUT_F32_TO_FXPANGLE(0.128199281231298f),
    IFX_LUT_F32_TO_FXPANGLE(0.129159762377265f),
    IFX_LUT_F32_TO_FXPANGLE(0.130120003943049f),
    IFX_LUT_F32_TO_FXPANGLE(0.131080004248137f),
    IFX_LUT_F32_TO_FXPANGLE(0.132039761614639f),
    IFX_LUT_F32_TO_FXPANGLE(0.132999274367304f),
    IFX_LUT_F32_TO_FXPANGLE(0.133958540833537f),
    IFX_LUT_F32_TO_FXPANGLE(0.134917559343415f),
    IFX_LUT_F32_TO_FXPANGLE(0.135876328229701f),
    IFX_LUT_F32_TO_FXPANGLE(0.136834845827863f),
    IFX_LUT_F32_TO_FXPANGLE(0.137793110476088f),
    IFX_LUT_F32_TO_FXPANGLE(0.138751120515297f),
    IFX_LUT_F32_TO_FXPANGLE(0.139708874289164f),
    IFX_LUT_F32_TO_FXPANGLE(0.140666370144127f),
    IFX_LUT_F32_TO_FXPANGLE(0.14162360642941f),
    IFX_LUT_F32_TO_FXPANGLE(0.14258058149703f),
    IFX_LUT_F32_TO_FXPANGLE(0.143537293701821f),
    IFX_LUT_F32_TO_FXPANGLE(0.144493741401443f),
    IFX_LUT_F32_TO_FXPANGLE(0.145449922956401f),
    IFX_LUT_F32_TO_FXPANGLE(0.146405836730058f),
    IFX_LUT_F32_TO_FXPANGLE(0.147361481088652f),
    IFX_LUT_F32_TO_FXPANGLE(0.148316854401309f),
    IFX_LUT_F32_TO_FXPANGLE(0.14927195504006f),
    IFX_LUT_F32_TO_FXPANGLE(0.150226781379856f),
    IFX_LUT_F32_TO_FXPANGLE(0.15118133179858f),
    IFX_LUT_F32_TO_FXPANGLE(0.152135604677064f),
    IFX_LUT_F32_TO_FXPANGLE(0.153089598399105f),
    IFX_LUT_F32_TO_FXPANGLE(0.154043311351475f),
    IFX_LUT_F32_TO_FXPANGLE(0.154996741923941f),
    IFX_LUT_F32_TO_FXPANGLE(0.155949888509276f),
    IFX_LUT_F32_TO_FXPANGLE(0.156902749503275f),
    IFX_LUT_F32_TO_FXPANGLE(0.157855323304766f),
    IFX_LUT_F32_TO_FXPANGLE(0.158807608315631f),
    IFX_LUT_F32_TO_FXPANGLE(0.159759602940813f),
    IFX_LUT_F32_TO_FXPANGLE(0.160711305588332f),
    IFX_LUT_F32_TO_FXPANGLE(0.161662714669305f),
    IFX_LUT_F32_TO_FXPANGLE(0.162613828597949f),
    IFX_LUT_F32_TO_FXPANGLE(0.163564645791604f),
    IFX_LUT_F32_TO_FXPANGLE(0.164515164670743f),
    IFX_LUT_F32_TO_FXPANGLE(0.165465383658987f),
    IFX_LUT_F32_TO_FXPANGLE(0.166415301183115f),
    IFX_LUT_F32_TO_FXPANGLE(0.167364915673083f),
    IFX_LUT_F32_TO_FXPANGLE(0.168314225562034f),
    IFX_LUT_F32_TO_FXPANGLE(0.169263229286312f),
    IFX_LUT_F32_TO_FXPANGLE(0.170211925285474f),
    IFX_LUT_F32_TO_FXPANGLE(0.171160312002307f),
    IFX_LUT_F32_TO_FXPANGLE(0.172108387882836f),
    IFX_LUT_F32_TO_FXPANGLE(0.17305615137634f),
    IFX_LUT_F32_TO_FXPANGLE(0.174003600935368f),
    IFX_LUT_F32_TO_FXPANGLE(0.174950735015743f),
    IFX_LUT_F32_TO_FXPANGLE(0.175897552076585f),
    IFX_LUT_F32_TO_FXPANGLE(0.176844050580316f),
    IFX_LUT_F32_TO_FXPANGLE(0.177790228992676f),
    IFX_LUT_F32_TO_FXPANGLE(0.178736085782736f),
    IFX_LUT_F32_TO_FXPANGLE(0.179681619422909f),
    IFX_LUT_F32_TO_FXPANGLE(0.180626828388963f),
    IFX_LUT_F32_TO_FXPANGLE(0.181571711160032f),
    IFX_LUT_F32_TO_FXPANGLE(0.182516266218631f),
    IFX_LUT_F32_TO_FXPANGLE(0.183460492050666f),
    IFX_LUT_F32_TO_FXPANGLE(0.184404387145446f),
    IFX_LUT_F32_TO_FXPANGLE(0.185347949995695f),
    IFX_LUT_F32_TO_FXPANGLE(0.186291179097566f),
    IFX_LUT_F32_TO_FXPANGLE(0.187234072950649f),
    IFX_LUT_F32_TO_FXPANGLE(0.188176630057987f),
    IFX_LUT_F32_TO_FXPANGLE(0.189118848926084f),
    IFX_LUT_F32_TO_FXPANGLE(0.190060728064918f),
    IFX_LUT_F32_TO_FXPANGLE(0.191002265987953f),
    IFX_LUT_F32_TO_FXPANGLE(0.191943461212149f),
    IFX_LUT_F32_TO_FXPANGLE(0.192884312257975f),
    IFX_LUT_F32_TO_FXPANGLE(0.193824817649417f),
    IFX_LUT_F32_TO_FXPANGLE(0.194764975913995f),
    IFX_LUT_F32_TO_FXPANGLE(0.195704785582767f),
    IFX_LUT_F32_TO_FXPANGLE(0.196644245190345f),
    IFX_LUT_F32_TO_FXPANGLE(0.197583353274903f),
    IFX_LUT_F32_TO_FXPANGLE(0.19852210837819f),
    IFX_LUT_F32_TO_FXPANGLE(0.199460509045539f),
    IFX_LUT_F32_TO_FXPANGLE(0.200398553825879f),
    IFX_LUT_F32_TO_FXPANGLE(0.201336241271742f),
    IFX_LUT_F32_TO_FXPANGLE(0.202273569939279f),
    IFX_LUT_F32_TO_FXPANGLE(0.203210538388266f),
    IFX_LUT_F32_TO_FXPANGLE(0.204147145182117f),
    IFX_LUT_F32_TO_FXPANGLE(0.205083388887891f),
    IFX_LUT_F32_TO_FXPANGLE(0.206019268076305f),
    IFX_LUT_F32_TO_FXPANGLE(0.206954781321742f),
    IFX_LUT_F32_TO_FXPANGLE(0.207889927202263f),
    IFX_LUT_F32_TO_FXPANGLE(0.208824704299615f),
    IFX_LUT_F32_TO_FXPANGLE(0.209759111199241f),
    IFX_LUT_F32_TO_FXPANGLE(0.210693146490291f),
    IFX_LUT_F32_TO_FXPANGLE(0.21162680876563f),
    IFX_LUT_F32_TO_FXPANGLE(0.212560096621847f),
    IFX_LUT_F32_TO_FXPANGLE(0.213493008659266f),
    IFX_LUT_F32_TO_FXPANGLE(0.214425543481956f),
    IFX_LUT_F32_TO_FXPANGLE(0.215357699697738f),
    IFX_LUT_F32_TO_FXPANGLE(0.216289475918194f),
    IFX_LUT_F32_TO_FXPANGLE(0.217220870758679f),
    IFX_LUT_F32_TO_FXPANGLE(0.218151882838326f),
    IFX_LUT_F32_TO_FXPANGLE(0.219082510780058f),
    IFX_LUT_F32_TO_FXPANGLE(0.220012753210596f),
    IFX_LUT_F32_TO_FXPANGLE(0.220942608760466f),
    IFX_LUT_F32_TO_FXPANGLE(0.22187207606401f),
    IFX_LUT_F32_TO_FXPANGLE(0.222801153759395f),
    IFX_LUT_F32_TO_FXPANGLE(0.223729840488615f),
    IFX_LUT_F32_TO_FXPANGLE(0.22465813489751f),
    IFX_LUT_F32_TO_FXPANGLE(0.225586035635764f),
    IFX_LUT_F32_TO_FXPANGLE(0.22651354135692f),
    IFX_LUT_F32_TO_FXPANGLE(0.227440650718385f),
    IFX_LUT_F32_TO_FXPANGLE(0.228367362381439f),
    IFX_LUT_F32_TO_FXPANGLE(0.229293675011242f),
    IFX_LUT_F32_TO_FXPANGLE(0.230219587276844f),
    IFX_LUT_F32_TO_FXPANGLE(0.231145097851188f),
    IFX_LUT_F32_TO_FXPANGLE(0.232070205411125f),
    IFX_LUT_F32_TO_FXPANGLE(0.232994908637414f),
    IFX_LUT_F32_TO_FXPANGLE(0.233919206214733f),
    IFX_LUT_F32_TO_FXPANGLE(0.234843096831689f),
    IFX_LUT_F32_TO_FXPANGLE(0.23576657918082f),
    IFX_LUT_F32_TO_FXPANGLE(0.236689651958605f),
    IFX_LUT_F32_TO_FXPANGLE(0.237612313865471f),
    IFX_LUT_F32_TO_FXPANGLE(0.238534563605801f),
    IFX_LUT_F32_TO_FXPANGLE(0.239456399887938f),
    IFX_LUT_F32_TO_FXPANGLE(0.240377821424194f),
    IFX_LUT_F32_TO_FXPANGLE(0.241298826930859f),
    IFX_LUT_F32_TO_FXPANGLE(0.242219415128201f),
    IFX_LUT_F32_TO_FXPANGLE(0.24313958474048f),
    IFX_LUT_F32_TO_FXPANGLE(0.244059334495949f),
    IFX_LUT_F32_TO_FXPANGLE(0.244978663126864f),
    IFX_LUT_F32_TO_FXPANGLE(0.24589756936949f),
    IFX_LUT_F32_TO_FXPANGLE(0.246816051964103f),
    IFX_LUT_F32_TO_FXPANGLE(0.247734109655002f),
    IFX_LUT_F32_TO_FXPANGLE(0.248651741190513f),
    IFX_LUT_F32_TO_FXPANGLE(0.249568945322993f),
    IFX_LUT_F32_TO_FXPANGLE(0.250485720808836f),
    IFX_LUT_F32_TO_FXPANGLE(0.251402066408485f),
    IFX_LUT_F32_TO_FXPANGLE(0.252317980886427f),
    IFX_LUT_F32_TO_FXPANGLE(0.25323346301121f),
    IFX_LUT_F32_TO_FXPANGLE(0.254148511555439f),
    IFX_LUT_F32_TO_FXPANGLE(0.25506312529579f),
    IFX_LUT_F32_TO_FXPANGLE(0.255977303013006f),
    IFX_LUT_F32_TO_FXPANGLE(0.25689104349191f),
    IFX_LUT_F32_TO_FXPANGLE(0.25780434552141f),
    IFX_LUT_F32_TO_FXPANGLE(0.258717207894497f),
    IFX_LUT_F32_TO_FXPANGLE(0.259629629408258f),
    IFX_LUT_F32_TO_FXPANGLE(0.260541608863876f),
    IFX_LUT_F32_TO_FXPANGLE(0.261453145066638f),
    IFX_LUT_F32_TO_FXPANGLE(0.262364236825938f),
    IFX_LUT_F32_TO_FXPANGLE(0.263274882955282f),
    IFX_LUT_F32_TO_FXPANGLE(0.264185082272293f),
    IFX_LUT_F32_TO_FXPANGLE(0.265094833598715f),
    IFX_LUT_F32_TO_FXPANGLE(0.266004135760417f),
    IFX_LUT_F32_TO_FXPANGLE(0.2669129875874f),
    IFX_LUT_F32_TO_FXPANGLE(0.267821387913799f),
    IFX_LUT_F32_TO_FXPANGLE(0.268729335577886f),
    IFX_LUT_F32_TO_FXPANGLE(0.269636829422078f),
    IFX_LUT_F32_TO_FXPANGLE(0.270543868292937f),
    IFX_LUT_F32_TO_FXPANGLE(0.271450451041176f),
    IFX_LUT_F32_TO_FXPANGLE(0.272356576521665f),
    IFX_LUT_F32_TO_FXPANGLE(0.27326224359343f),
    IFX_LUT_F32_TO_FXPANGLE(0.274167451119659f),
    IFX_LUT_F32_TO_FXPANGLE(0.275072197967707f),
    IFX_LUT_F32_TO_FXPANGLE(0.275976483009098f),
    IFX_LUT_F32_TO_FXPANGLE(0.27688030511953f),
    IFX_LUT_F32_TO_FXPANGLE(0.277783663178873f),
    IFX_LUT_F32_TO_FXPANGLE(0.278686556071182f),
    IFX_LUT_F32_TO_FXPANGLE(0.27958898268469f),
    IFX_LUT_F32_TO_FXPANGLE(0.280490941911819f),
    IFX_LUT_F32_TO_FXPANGLE(0.281392432649178f),
    IFX_LUT_F32_TO_FXPANGLE(0.282293453797569f),
    IFX_LUT_F32_TO_FXPANGLE(0.283194004261987f),
    IFX_LUT_F32_TO_FXPANGLE(0.284094082951627f),
    IFX_LUT_F32_TO_FXPANGLE(0.284993688779881f),
    IFX_LUT_F32_TO_FXPANGLE(0.285892820664347f),
    IFX_LUT_F32_TO_FXPANGLE(0.286791477526827f),
    IFX_LUT_F32_TO_FXPANGLE(0.28768965829333f),
    IFX_LUT_F32_TO_FXPANGLE(0.288587361894077f),
    IFX_LUT_F32_TO_FXPANGLE(0.289484587263501f),
    IFX_LUT_F32_TO_FXPANGLE(0.29038133334025f),
    IFX_LUT_F32_TO_FXPANGLE(0.291277599067188f),
    IFX_LUT_F32_TO_FXPANGLE(0.292173383391399f),
    IFX_LUT_F32_TO_FXPANGLE(0.293068685264188f),
    IFX_LUT_F32_TO_FXPANGLE(0.293963503641084f),
    IFX_LUT_F32_TO_FXPANGLE(0.294857837481838f),
    IFX_LUT_F32_TO_FXPANGLE(0.295751685750432f),
    IFX_LUT_F32_TO_FXPANGLE(0.296645047415071f),
    IFX_LUT_F32_TO_FXPANGLE(0.297537921448196f),
    IFX_LUT_F32_TO_FXPANGLE(0.298430306826474f),
    IFX_LUT_F32_TO_FXPANGLE(0.299322202530807f),
    IFX_LUT_F32_TO_FXPANGLE(0.300213607546333f),
    IFX_LUT_F32_TO_FXPANGLE(0.301104520862424f),
    IFX_LUT_F32_TO_FXPANGLE(0.301994941472688f),
    IFX_LUT_F32_TO_FXPANGLE(0.302884868374971f),
    IFX_LUT_F32_TO_FXPANGLE(0.303774300571361f),
    IFX_LUT_F32_TO_FXPANGLE(0.304663237068183f),
    IFX_LUT_F32_TO_FXPANGLE(0.305551676876003f),
    IFX_LUT_F32_TO_FXPANGLE(0.30643961900963f),
    IFX_LUT_F32_TO_FXPANGLE(0.307327062488116f),
    IFX_LUT_F32_TO_FXPANGLE(0.308214006334753f),
    IFX_LUT_F32_TO_FXPANGLE(0.309100449577082f),
    IFX_LUT_F32_TO_FXPANGLE(0.309986391246883f),
    IFX_LUT_F32_TO_FXPANGLE(0.310871830380185f),
    IFX_LUT_F32_TO_FXPANGLE(0.31175676601726f),
    IFX_LUT_F32_TO_FXPANGLE(0.312641197202625f),
    IFX_LUT_F32_TO_FXPANGLE(0.313525122985044f),
    IFX_LUT_F32_TO_FXPANGLE(0.314408542417527f),
    IFX_LUT_F32_TO_FXPANGLE(0.31529145455733f),
    IFX_LUT_F32_TO_FXPANGLE(0.316173858465954f),
    IFX_LUT_F32_TO_FXPANGLE(0.317055753209147f),
    IFX_LUT_F32_TO_FXPANGLE(0.317937137856902f),
    IFX_LUT_F32_TO_FXPANGLE(0.318818011483458f),
    IFX_LUT_F32_TO_FXPANGLE(0.3196983731673f),
    IFX_LUT_F32_TO_FXPANGLE(0.320578221991157f),
    IFX_LUT_F32_TO_FXPANGLE(0.321457557042003f),
    IFX_LUT_F32_TO_FXPANGLE(0.322336377411056f),
    IFX_LUT_F32_TO_FXPANGLE(0.323214682193777f),
    IFX_LUT_F32_TO_FXPANGLE(0.324092470489872f),
    IFX_LUT_F32_TO_FXPANGLE(0.324969741403286f),
    IFX_LUT_F32_TO_FXPANGLE(0.325846494042208f),
    IFX_LUT_F32_TO_FXPANGLE(0.326722727519067f),
    IFX_LUT_F32_TO_FXPANGLE(0.327598440950531f),
    IFX_LUT_F32_TO_FXPANGLE(0.328473633457506f),
    IFX_LUT_F32_TO_FXPANGLE(0.329348304165139f),
    IFX_LUT_F32_TO_FXPANGLE(0.330222452202808f),
    IFX_LUT_F32_TO_FXPANGLE(0.331096076704132f),
    IFX_LUT_F32_TO_FXPANGLE(0.33196917680696f),
    IFX_LUT_F32_TO_FXPANGLE(0.332841751653376f),
    IFX_LUT_F32_TO_FXPANGLE(0.333713800389694f),
    IFX_LUT_F32_TO_FXPANGLE(0.334585322166459f),
    IFX_LUT_F32_TO_FXPANGLE(0.335456316138443f),
    IFX_LUT_F32_TO_FXPANGLE(0.336326781464645f),
    IFX_LUT_F32_TO_FXPANGLE(0.33719671730829f),
    IFX_LUT_F32_TO_FXPANGLE(0.338066122836825f),
    IFX_LUT_F32_TO_FXPANGLE(0.338934997221921f),
    IFX_LUT_F32_TO_FXPANGLE(0.339803339639465f),
    IFX_LUT_F32_TO_FXPANGLE(0.340671149269565f),
    IFX_LUT_F32_TO_FXPANGLE(0.341538425296542f),
    IFX_LUT_F32_TO_FXPANGLE(0.342405166908932f),
    IFX_LUT_F32_TO_FXPANGLE(0.343271373299484f),
    IFX_LUT_F32_TO_FXPANGLE(0.344137043665154f),
    IFX_LUT_F32_TO_FXPANGLE(0.345002177207105f),
    IFX_LUT_F32_TO_FXPANGLE(0.345866773130707f),
    IFX_LUT_F32_TO_FXPANGLE(0.34673083064553f),
    IFX_LUT_F32_TO_FXPANGLE(0.347594348965346f),
    IFX_LUT_F32_TO_FXPANGLE(0.348457327308122f),
    IFX_LUT_F32_TO_FXPANGLE(0.349319764896022f),
    IFX_LUT_F32_TO_FXPANGLE(0.350181660955402f),
    IFX_LUT_F32_TO_FXPANGLE(0.351043014716805f),
    IFX_LUT_F32_TO_FXPANGLE(0.351903825414965f),
    IFX_LUT_F32_TO_FXPANGLE(0.352764092288795f),
    IFX_LUT_F32_TO_FXPANGLE(0.353623814581394f),
    IFX_LUT_F32_TO_FXPANGLE(0.354482991540035f),
    IFX_LUT_F32_TO_FXPANGLE(0.355341622416168f),
    IFX_LUT_F32_TO_FXPANGLE(0.356199706465416f),
    IFX_LUT_F32_TO_FXPANGLE(0.357057242947567f),
    IFX_LUT_F32_TO_FXPANGLE(0.35791423112658f),
    IFX_LUT_F32_TO_FXPANGLE(0.358770670270572f),
    IFX_LUT_F32_TO_FXPANGLE(0.359626559651822f),
    IFX_LUT_F32_TO_FXPANGLE(0.360481898546763f),
    IFX_LUT_F32_TO_FXPANGLE(0.361336686235982f),
    IFX_LUT_F32_TO_FXPANGLE(0.362190922004212f),
    IFX_LUT_F32_TO_FXPANGLE(0.363044605140335f),
    IFX_LUT_F32_TO_FXPANGLE(0.363897734937373f),
    IFX_LUT_F32_TO_FXPANGLE(0.364750310692485f),
    IFX_LUT_F32_TO_FXPANGLE(0.365602331706967f),
    IFX_LUT_F32_TO_FXPANGLE(0.366453797286243f),
    IFX_LUT_F32_TO_FXPANGLE(0.367304706739864f),
    IFX_LUT_F32_TO_FXPANGLE(0.368155059381507f),
    IFX_LUT_F32_TO_FXPANGLE(0.369004854528964f),
    IFX_LUT_F32_TO_FXPANGLE(0.369854091504145f),
    IFX_LUT_F32_TO_FXPANGLE(0.370702769633069f),
    IFX_LUT_F32_TO_FXPANGLE(0.371550888245862f),
    IFX_LUT_F32_TO_FXPANGLE(0.372398446676754f),
    IFX_LUT_F32_TO_FXPANGLE(0.373245444264073f),
    IFX_LUT_F32_TO_FXPANGLE(0.374091880350239f),
    IFX_LUT_F32_TO_FXPANGLE(0.374937754281765f),
    IFX_LUT_F32_TO_FXPANGLE(0.375783065409249f),
    IFX_LUT_F32_TO_FXPANGLE(0.376627813087368f),
    IFX_LUT_F32_TO_FXPANGLE(0.377471996674877f),
    IFX_LUT_F32_TO_FXPANGLE(0.378315615534604f),
    IFX_LUT_F32_TO_FXPANGLE(0.379158669033442f),
    IFX_LUT_F32_TO_FXPANGLE(0.380001156542349f),
    IFX_LUT_F32_TO_FXPANGLE(0.380843077436342f),
    IFX_LUT_F32_TO_FXPANGLE(0.381684431094488f),
    IFX_LUT_F32_TO_FXPANGLE(0.382525216899905f),
    IFX_LUT_F32_TO_FXPANGLE(0.383365434239755f),
    IFX_LUT_F32_TO_FXPANGLE(0.384205082505239f),
    IFX_LUT_F32_TO_FXPANGLE(0.385044161091591f),
    IFX_LUT_F32_TO_FXPANGLE(0.385882669398074f),
    IFX_LUT_F32_TO_FXPANGLE(0.386720606827975f),
    IFX_LUT_F32_TO_FXPANGLE(0.387557972788602f),
    IFX_LUT_F32_TO_FXPANGLE(0.388394766691274f),
    IFX_LUT_F32_TO_FXPANGLE(0.389230987951321f),
    IFX_LUT_F32_TO_FXPANGLE(0.390066635988073f),
    IFX_LUT_F32_TO_FXPANGLE(0.390901710224862f),
    IFX_LUT_F32_TO_FXPANGLE(0.39173621008901f),
    IFX_LUT_F32_TO_FXPANGLE(0.392570135011829f),
    IFX_LUT_F32_TO_FXPANGLE(0.393403484428609f),
    IFX_LUT_F32_TO_FXPANGLE(0.394236257778621f),
    IFX_LUT_F32_TO_FXPANGLE(0.395068454505103f),
    IFX_LUT_F32_TO_FXPANGLE(0.395900074055263f),
    IFX_LUT_F32_TO_FXPANGLE(0.396731115880264f),
    IFX_LUT_F32_TO_FXPANGLE(0.397561579435227f),
    IFX_LUT_F32_TO_FXPANGLE(0.39839146417922f),
    IFX_LUT_F32_TO_FXPANGLE(0.399220769575253f),
    IFX_LUT_F32_TO_FXPANGLE(0.400049495090274f),
    IFX_LUT_F32_TO_FXPANGLE(0.400877640195163f),
    IFX_LUT_F32_TO_FXPANGLE(0.401705204364725f),
    IFX_LUT_F32_TO_FXPANGLE(0.402532187077683f),
    IFX_LUT_F32_TO_FXPANGLE(0.403358587816674f),
    IFX_LUT_F32_TO_FXPANGLE(0.404184406068245f),
    IFX_LUT_F32_TO_FXPANGLE(0.405009641322841f),
    IFX_LUT_F32_TO_FXPANGLE(0.405834293074804f),
