Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Service/CpuGeneric/SysSe/Math/Ifx_LutAtan2F32_Table.c
    IFX_LUT_F32_TO_FXPANGLE(0.406658360822366f),
    IFX_LUT_F32_TO_FXPANGLE(0.407481844067642f),
    IFX_LUT_F32_TO_FXPANGLE(0.408304742316622f),
    IFX_LUT_F32_TO_FXPANGLE(0.409127055079168f),
    IFX_LUT_F32_TO_FXPANGLE(0.409948781869008f),
    IFX_LUT_F32_TO_FXPANGLE(0.410769922203726f),
    IFX_LUT_F32_TO_FXPANGLE(0.411590475604759f),
    IFX_LUT_F32_TO_FXPANGLE(0.412410441597387f),
    IFX_LUT_F32_TO_FXPANGLE(0.413229819710733f),
    IFX_LUT_F32_TO_FXPANGLE(0.414048609477749f),
    IFX_LUT_F32_TO_FXPANGLE(0.414866810435215f),
    IFX_LUT_F32_TO_FXPANGLE(0.415684422123729f),
    IFX_LUT_F32_TO_FXPANGLE(0.416501444087703f),
    IFX_LUT_F32_TO_FXPANGLE(0.417317875875355f),
    IFX_LUT_F32_TO_FXPANGLE(0.418133717038701f),
    IFX_LUT_F32_TO_FXPANGLE(0.418948967133553f),
    IFX_LUT_F32_TO_FXPANGLE(0.419763625719506f),
    IFX_LUT_F32_TO_FXPANGLE(0.420577692359935f),
    IFX_LUT_F32_TO_FXPANGLE(0.42139116662199f),
    IFX_LUT_F32_TO_FXPANGLE(0.422204048076584f),
    IFX_LUT_F32_TO_FXPANGLE(0.423016336298389f),
    IFX_LUT_F32_TO_FXPANGLE(0.423828030865831f),
    IFX_LUT_F32_TO_FXPANGLE(0.42463913136108f),
    IFX_LUT_F32_TO_FXPANGLE(0.425449637370042f),
    IFX_LUT_F32_TO_FXPANGLE(0.426259548482358f),
    IFX_LUT_F32_TO_FXPANGLE(0.427068864291389f),
    IFX_LUT_F32_TO_FXPANGLE(0.427877584394215f),
    IFX_LUT_F32_TO_FXPANGLE(0.428685708391626f),
    IFX_LUT_F32_TO_FXPANGLE(0.429493235888114f),
    IFX_LUT_F32_TO_FXPANGLE(0.430300166491866f),
    IFX_LUT_F32_TO_FXPANGLE(0.431106499814758f),
    IFX_LUT_F32_TO_FXPANGLE(0.431912235472348f),
    IFX_LUT_F32_TO_FXPANGLE(0.432717373083866f),
    IFX_LUT_F32_TO_FXPANGLE(0.433521912272209f),
    IFX_LUT_F32_TO_FXPANGLE(0.434325852663933f),
    IFX_LUT_F32_TO_FXPANGLE(0.435129193889247f),
    IFX_LUT_F32_TO_FXPANGLE(0.435931935582003f),
    IFX_LUT_F32_TO_FXPANGLE(0.43673407737969f),
    IFX_LUT_F32_TO_FXPANGLE(0.437535618923428f),
    IFX_LUT_F32_TO_FXPANGLE(0.438336559857958f),
    IFX_LUT_F32_TO_FXPANGLE(0.439136899831635f),
    IFX_LUT_F32_TO_FXPANGLE(0.439936638496422f),
    IFX_LUT_F32_TO_FXPANGLE(0.440735775507881f),
    IFX_LUT_F32_TO_FXPANGLE(0.441534310525167f),
    IFX_LUT_F32_TO_FXPANGLE(0.442332243211017f),
    IFX_LUT_F32_TO_FXPANGLE(0.443129573231746f),
    IFX_LUT_F32_TO_FXPANGLE(0.443926300257239f),
    IFX_LUT_F32_TO_FXPANGLE(0.444722423960939f),
    IFX_LUT_F32_TO_FXPANGLE(0.445517944019847f),
    IFX_LUT_F32_TO_FXPANGLE(0.446312860114506f),
    IFX_LUT_F32_TO_FXPANGLE(0.447107171928999f),
    IFX_LUT_F32_TO_FXPANGLE(0.447900879150937f),
    IFX_LUT_F32_TO_FXPANGLE(0.448693981471457f),
    IFX_LUT_F32_TO_FXPANGLE(0.449486478585208f),
    IFX_LUT_F32_TO_FXPANGLE(0.450278370190345f),
    IFX_LUT_F32_TO_FXPANGLE(0.451069655988523f),
    IFX_LUT_F32_TO_FXPANGLE(0.451860335684889f),
    IFX_LUT_F32_TO_FXPANGLE(0.452650408988071f),
    IFX_LUT_F32_TO_FXPANGLE(0.453439875610172f),
    IFX_LUT_F32_TO_FXPANGLE(0.454228735266762f),
    IFX_LUT_F32_TO_FXPANGLE(0.455016987676872f),
    IFX_LUT_F32_TO_FXPANGLE(0.45580463256298f),
    IFX_LUT_F32_TO_FXPANGLE(0.456591669651011f),
    IFX_LUT_F32_TO_FXPANGLE(0.457378098670321f),
    IFX_LUT_F32_TO_FXPANGLE(0.458163919353695f),
    IFX_LUT_F32_TO_FXPANGLE(0.458949131437335f),
    IFX_LUT_F32_TO_FXPANGLE(0.459733734660856f),
    IFX_LUT_F32_TO_FXPANGLE(0.460517728767271f),
    IFX_LUT_F32_TO_FXPANGLE(0.461301113502991f),
    IFX_LUT_F32_TO_FXPANGLE(0.46208388861781f),
    IFX_LUT_F32_TO_FXPANGLE(0.462866053864901f),
    IFX_LUT_F32_TO_FXPANGLE(0.463647609000806f),
    IFX_LUT_F32_TO_FXPANGLE(0.464428553785428f),
    IFX_LUT_F32_TO_FXPANGLE(0.465208887982023f),
    IFX_LUT_F32_TO_FXPANGLE(0.46598861135719f),
    IFX_LUT_F32_TO_FXPANGLE(0.466767723680866f),
    IFX_LUT_F32_TO_FXPANGLE(0.467546224726316f),
    IFX_LUT_F32_TO_FXPANGLE(0.468324114270123f),
    IFX_LUT_F32_TO_FXPANGLE(0.46910139209218f),
    IFX_LUT_F32_TO_FXPANGLE(0.469878057975687f),
    IFX_LUT_F32_TO_FXPANGLE(0.470654111707133f),
    IFX_LUT_F32_TO_FXPANGLE(0.471429553076297f),
    IFX_LUT_F32_TO_FXPANGLE(0.472204381876234f),
    IFX_LUT_F32_TO_FXPANGLE(0.472978597903266f),
    IFX_LUT_F32_TO_FXPANGLE(0.473752200956977f),
    IFX_LUT_F32_TO_FXPANGLE(0.474525190840205f),
    IFX_LUT_F32_TO_FXPANGLE(0.475297567359028f),
    IFX_LUT_F32_TO_FXPANGLE(0.476069330322761f),
    IFX_LUT_F32_TO_FXPANGLE(0.476840479543945f),
    IFX_LUT_F32_TO_FXPANGLE(0.477611014838337f),
    IFX_LUT_F32_TO_FXPANGLE(0.478380936024907f),
    IFX_LUT_F32_TO_FXPANGLE(0.479150242925823f),
    IFX_LUT_F32_TO_FXPANGLE(0.479918935366444f),
    IFX_LUT_F32_TO_FXPANGLE(0.480687013175316f),
    IFX_LUT_F32_TO_FXPANGLE(0.481454476184158f),
    IFX_LUT_F32_TO_FXPANGLE(0.482221324227854f),
    IFX_LUT_F32_TO_FXPANGLE(0.482987557144447f),
    IFX_LUT_F32_TO_FXPANGLE(0.48375317477513f),
    IFX_LUT_F32_TO_FXPANGLE(0.484518176964233f),
    IFX_LUT_F32_TO_FXPANGLE(0.485282563559221f),
    IFX_LUT_F32_TO_FXPANGLE(0.48604633441068f),
    IFX_LUT_F32_TO_FXPANGLE(0.48680948937231f),
    IFX_LUT_F32_TO_FXPANGLE(0.487572028300918f),
    IFX_LUT_F32_TO_FXPANGLE(0.488333951056406f),
    IFX_LUT_F32_TO_FXPANGLE(0.489095257501764f),
    IFX_LUT_F32_TO_FXPANGLE(0.489855947503062f),
    IFX_LUT_F32_TO_FXPANGLE(0.490616020929441f),
    IFX_LUT_F32_TO_FXPANGLE(0.491375477653102f),
    IFX_LUT_F32_TO_FXPANGLE(0.4921343175493f),
    IFX_LUT_F32_TO_FXPANGLE(0.492892540496335f),
    IFX_LUT_F32_TO_FXPANGLE(0.49365014637554f),
    IFX_LUT_F32_TO_FXPANGLE(0.494407135071275f),
    IFX_LUT_F32_TO_FXPANGLE(0.49516350647092f),
    IFX_LUT_F32_TO_FXPANGLE(0.495919260464861f),
    IFX_LUT_F32_TO_FXPANGLE(0.496674396946486f),
    IFX_LUT_F32_TO_FXPANGLE(0.497428915812172f),
    IFX_LUT_F32_TO_FXPANGLE(0.498182816961281f),
    IFX_LUT_F32_TO_FXPANGLE(0.498936100296146f),
    IFX_LUT_F32_TO_FXPANGLE(0.499688765722065f),
    IFX_LUT_F32_TO_FXPANGLE(0.500440813147294f),
    IFX_LUT_F32_TO_FXPANGLE(0.501192242483033f),
    IFX_LUT_F32_TO_FXPANGLE(0.501943053643421f),
    IFX_LUT_F32_TO_FXPANGLE(0.502693246545526f),
    IFX_LUT_F32_TO_FXPANGLE(0.503442821109336f),
    IFX_LUT_F32_TO_FXPANGLE(0.504191777257751f),
    IFX_LUT_F32_TO_FXPANGLE(0.504940114916572f),
    IFX_LUT_F32_TO_FXPANGLE(0.505687834014494f),
    IFX_LUT_F32_TO_FXPANGLE(0.506434934483097f),
    IFX_LUT_F32_TO_FXPANGLE(0.507181416256835f),
    IFX_LUT_F32_TO_FXPANGLE(0.50792727927303f),
    IFX_LUT_F32_TO_FXPANGLE(0.508672523471861f),
    IFX_LUT_F32_TO_FXPANGLE(0.509417148796356f),
    IFX_LUT_F32_TO_FXPANGLE(0.510161155192383f),
    IFX_LUT_F32_TO_FXPANGLE(0.51090454260864f),
    IFX_LUT_F32_TO_FXPANGLE(0.511647310996647f),
    IFX_LUT_F32_TO_FXPANGLE(0.512389460310738f),
    IFX_LUT_F32_TO_FXPANGLE(0.513130990508049f),
    IFX_LUT_F32_TO_FXPANGLE(0.513871901548512f),
    IFX_LUT_F32_TO_FXPANGLE(0.514612193394845f),
    IFX_LUT_F32_TO_FXPANGLE(0.515351866012543f),
    IFX_LUT_F32_TO_FXPANGLE(0.51609091936987f),
    IFX_LUT_F32_TO_FXPANGLE(0.516829353437846f),
    IFX_LUT_F32_TO_FXPANGLE(0.517567168190245f),
    IFX_LUT_F32_TO_FXPANGLE(0.518304363603578f),
    IFX_LUT_F32_TO_FXPANGLE(0.519040939657092f),
    IFX_LUT_F32_TO_FXPANGLE(0.519776896332754f),
    IFX_LUT_F32_TO_FXPANGLE(0.520512233615247f),
    IFX_LUT_F32_TO_FXPANGLE(0.521246951491958f),
    IFX_LUT_F32_TO_FXPANGLE(0.521981049952972f),
    IFX_LUT_F32_TO_FXPANGLE(0.522714528991058f),
    IFX_LUT_F32_TO_FXPANGLE(0.523447388601666f),
    IFX_LUT_F32_TO_FXPANGLE(0.524179628782913f),
    IFX_LUT_F32_TO_FXPANGLE(0.524911249535579f),
    IFX_LUT_F32_TO_FXPANGLE(0.525642250863092f),
    IFX_LUT_F32_TO_FXPANGLE(0.526372632771524f),
    IFX_LUT_F32_TO_FXPANGLE(0.52710239526958f),
    IFX_LUT_F32_TO_FXPANGLE(0.527831538368588f),
    IFX_LUT_F32_TO_FXPANGLE(0.528560062082493f),
    IFX_LUT_F32_TO_FXPANGLE(0.529287966427846f),
    IFX_LUT_F32_TO_FXPANGLE(0.530015251423793f),
    IFX_LUT_F32_TO_FXPANGLE(0.530741917092071f),
    IFX_LUT_F32_TO_FXPANGLE(0.531467963456995f),
    IFX_LUT_F32_TO_FXPANGLE(0.53219339054545f),
    IFX_LUT_F32_TO_FXPANGLE(0.532918198386882f),
    IFX_LUT_F32_TO_FXPANGLE(0.533642387013291f),
    IFX_LUT_F32_TO_FXPANGLE(0.534365956459219f),
    IFX_LUT_F32_TO_FXPANGLE(0.535088906761743f),
    IFX_LUT_F32_TO_FXPANGLE(0.535811237960464f),
    IFX_LUT_F32_TO_FXPANGLE(0.5365329500975f),
    IFX_LUT_F32_TO_FXPANGLE(0.537254043217479f),
    IFX_LUT_F32_TO_FXPANGLE(0.537974517367523f),
    IFX_LUT_F32_TO_FXPANGLE(0.538694372597247f),
    IFX_LUT_F32_TO_FXPANGLE(0.539413608958744f),
    IFX_LUT_F32_TO_FXPANGLE(0.540132226506582f),
    IFX_LUT_F32_TO_FXPANGLE(0.540850225297788f),
    IFX_LUT_F32_TO_FXPANGLE(0.541567605391845f),
    IFX_LUT_F32_TO_FXPANGLE(0.542284366850679f),
    IFX_LUT_F32_TO_FXPANGLE(0.543000509738655f),
    IFX_LUT_F32_TO_FXPANGLE(0.54371603412256f),
    IFX_LUT_F32_TO_FXPANGLE(0.544430940071603f),
    IFX_LUT_F32_TO_FXPANGLE(0.545145227657401f),
    IFX_LUT_F32_TO_FXPANGLE(0.54585889695397f),
    IFX_LUT_F32_TO_FXPANGLE(0.546571948037719f),
    IFX_LUT_F32_TO_FXPANGLE(0.547284380987437f),
    IFX_LUT_F32_TO_FXPANGLE(0.547996195884288f),
    IFX_LUT_F32_TO_FXPANGLE(0.548707392811801f),
    IFX_LUT_F32_TO_FXPANGLE(0.549417971855859f),
    IFX_LUT_F32_TO_FXPANGLE(0.550127933104693f),
    IFX_LUT_F32_TO_FXPANGLE(0.55083727664887f),
    IFX_LUT_F32_TO_FXPANGLE(0.551546002581289f),
    IFX_LUT_F32_TO_FXPANGLE(0.552254110997165f),
    IFX_LUT_F32_TO_FXPANGLE(0.552961601994028f),
    IFX_LUT_F32_TO_FXPANGLE(0.553668475671709f),
    IFX_LUT_F32_TO_FXPANGLE(0.554374732132331f),
    IFX_LUT_F32_TO_FXPANGLE(0.555080371480305f),
    IFX_LUT_F32_TO_FXPANGLE(0.555785393822314f),
    IFX_LUT_F32_TO_FXPANGLE(0.55648979926731f),
    IFX_LUT_F32_TO_FXPANGLE(0.557193587926504f),
    IFX_LUT_F32_TO_FXPANGLE(0.557896759913355f),
    IFX_LUT_F32_TO_FXPANGLE(0.558599315343562f),
    IFX_LUT_F32_TO_FXPANGLE(0.559301254335059f),
    IFX_LUT_F32_TO_FXPANGLE(0.560002577007999f),
    IFX_LUT_F32_TO_FXPANGLE(0.560703283484751f),
    IFX_LUT_F32_TO_FXPANGLE(0.561403373889889f),
    IFX_LUT_F32_TO_FXPANGLE(0.562102848350186f),
    IFX_LUT_F32_TO_FXPANGLE(0.562801706994599f),
    IFX_LUT_F32_TO_FXPANGLE(0.563499949954267f),
    IFX_LUT_F32_TO_FXPANGLE(0.564197577362498f),
    IFX_LUT_F32_TO_FXPANGLE(0.564894589354762f),
    IFX_LUT_F32_TO_FXPANGLE(0.565590986068683f),
    IFX_LUT_F32_TO_FXPANGLE(0.566286767644028f),
    IFX_LUT_F32_TO_FXPANGLE(0.5669819342227f),
    IFX_LUT_F32_TO_FXPANGLE(0.56767648594873f),
    IFX_LUT_F32_TO_FXPANGLE(0.568370422968264f),
    IFX_LUT_F32_TO_FXPANGLE(0.569063745429561f),
    IFX_LUT_F32_TO_FXPANGLE(0.569756453482978f),
    IFX_LUT_F32_TO_FXPANGLE(0.570448547280968f),
    IFX_LUT_F32_TO_FXPANGLE(0.571140026978063f),
    IFX_LUT_F32_TO_FXPANGLE(0.571830892730873f),
    IFX_LUT_F32_TO_FXPANGLE(0.572521144698072f),
    IFX_LUT_F32_TO_FXPANGLE(0.573210783040395f),
    IFX_LUT_F32_TO_FXPANGLE(0.573899807920624f),
    IFX_LUT_F32_TO_FXPANGLE(0.57458821950358f),
    IFX_LUT_F32_TO_FXPANGLE(0.575276017956118f),
    IFX_LUT_F32_TO_FXPANGLE(0.575963203447116f),
    IFX_LUT_F32_TO_FXPANGLE(0.576649776147467f),
    IFX_LUT_F32_TO_FXPANGLE(0.577335736230069f),
    IFX_LUT_F32_TO_FXPANGLE(0.57802108386982f),
    IFX_LUT_F32_TO_FXPANGLE(0.578705819243603f),
    IFX_LUT_F32_TO_FXPANGLE(0.579389942530287f),
    IFX_LUT_F32_TO_FXPANGLE(0.580073453910708f),
    IFX_LUT_F32_TO_FXPANGLE(0.58075635356767f),
    IFX_LUT_F32_TO_FXPANGLE(0.58143864168593f),
    IFX_LUT_F32_TO_FXPANGLE(0.582120318452191f),
    IFX_LUT_F32_TO_FXPANGLE(0.582801384055095f),
    IFX_LUT_F32_TO_FXPANGLE(0.583481838685215f),
    IFX_LUT_F32_TO_FXPANGLE(0.584161682535044f),
    IFX_LUT_F32_TO_FXPANGLE(0.584840915798988f),
    IFX_LUT_F32_TO_FXPANGLE(0.585519538673358f),
    IFX_LUT_F32_TO_FXPANGLE(0.586197551356361f),
    IFX_LUT_F32_TO_FXPANGLE(0.586874954048091f),
    IFX_LUT_F32_TO_FXPANGLE(0.587551746950524f),
    IFX_LUT_F32_TO_FXPANGLE(0.588227930267504f),
    IFX_LUT_F32_TO_FXPANGLE(0.588903504204738f),
    IFX_LUT_F32_TO_FXPANGLE(0.58957846896979f),
    IFX_LUT_F32_TO_FXPANGLE(0.590252824772067f),
    IFX_LUT_F32_TO_FXPANGLE(0.590926571822816f),
    IFX_LUT_F32_TO_FXPANGLE(0.591599710335111f),
    IFX_LUT_F32_TO_FXPANGLE(0.592272240523851f),
    IFX_LUT_F32_TO_FXPANGLE(0.592944162605743f),
    IFX_LUT_F32_TO_FXPANGLE(0.593615476799303f),
    IFX_LUT_F32_TO_FXPANGLE(0.594286183324841f),
    IFX_LUT_F32_TO_FXPANGLE(0.594956282404456f),
    IFX_LUT_F32_TO_FXPANGLE(0.595625774262027f),
    IFX_LUT_F32_TO_FXPANGLE(0.596294659123204f),
    IFX_LUT_F32_TO_FXPANGLE(0.596962937215402f),
    IFX_LUT_F32_TO_FXPANGLE(0.597630608767789f),
    IFX_LUT_F32_TO_FXPANGLE(0.598297674011284f),
    IFX_LUT_F32_TO_FXPANGLE(0.598964133178543f),
    IFX_LUT_F32_TO_FXPANGLE(0.599629986503951f),
    IFX_LUT_F32_TO_FXPANGLE(0.600295234223621f),
    IFX_LUT_F32_TO_FXPANGLE(0.600959876575375f),
    IFX_LUT_F32_TO_FXPANGLE(0.601623913798746f),
    IFX_LUT_F32_TO_FXPANGLE(0.602287346134964f),
    IFX_LUT_F32_TO_FXPANGLE(0.60295017382695f),
    IFX_LUT_F32_TO_FXPANGLE(0.603612397119307f),
    IFX_LUT_F32_TO_FXPANGLE(0.604274016258314f),
    IFX_LUT_F32_TO_FXPANGLE(0.604935031491914f),
    IFX_LUT_F32_TO_FXPANGLE(0.605595443069711f),
    IFX_LUT_F32_TO_FXPANGLE(0.606255251242958f),
    IFX_LUT_F32_TO_FXPANGLE(0.606914456264552f),
    IFX_LUT_F32_TO_FXPANGLE(0.607573058389022f),
    IFX_LUT_F32_TO_FXPANGLE(0.608231057872528f),
    IFX_LUT_F32_TO_FXPANGLE(0.608888454972845f),
    IFX_LUT_F32_TO_FXPANGLE(0.609545249949361f),
    IFX_LUT_F32_TO_FXPANGLE(0.610201443063065f),
    IFX_LUT_F32_TO_FXPANGLE(0.610857034576544f),
    IFX_LUT_F32_TO_FXPANGLE(0.611512024753969f),
    IFX_LUT_F32_TO_FXPANGLE(0.612166413861094f),
    IFX_LUT_F32_TO_FXPANGLE(0.612820202165241f),
    IFX_LUT_F32_TO_FXPANGLE(0.613473389935299f),
    IFX_LUT_F32_TO_FXPANGLE(0.614125977441711f),
    IFX_LUT_F32_TO_FXPANGLE(0.614777964956469f),
    IFX_LUT_F32_TO_FXPANGLE(0.615429352753105f),
    IFX_LUT_F32_TO_FXPANGLE(0.616080141106684f),
    IFX_LUT_F32_TO_FXPANGLE(0.616730330293797f),
    IFX_LUT_F32_TO_FXPANGLE(0.617379920592551f),
    IFX_LUT_F32_TO_FXPANGLE(0.618028912282562f),
    IFX_LUT_F32_TO_FXPANGLE(0.61867730564495f),
    IFX_LUT_F32_TO_FXPANGLE(0.619325100962327f),
    IFX_LUT_F32_TO_FXPANGLE(0.619972298518794f),
    IFX_LUT_F32_TO_FXPANGLE(0.620618898599929f),
    IFX_LUT_F32_TO_FXPANGLE(0.621264901492783f),
    IFX_LUT_F32_TO_FXPANGLE(0.621910307485869f),
    IFX_LUT_F32_TO_FXPANGLE(0.622555116869157f),
    IFX_LUT_F32_TO_FXPANGLE(0.623199329934066f),
    IFX_LUT_F32_TO_FXPANGLE(0.623842946973455f),
    IFX_LUT_F32_TO_FXPANGLE(0.624485968281619f),
    IFX_LUT_F32_TO_FXPANGLE(0.625128394154276f),
    IFX_LUT_F32_TO_FXPANGLE(0.625770224888563f),
    IFX_LUT_F32_TO_FXPANGLE(0.626411460783031f),
    IFX_LUT_F32_TO_FXPANGLE(0.62705210213763f),
    IFX_LUT_F32_TO_FXPANGLE(0.627692149253711f),
    IFX_LUT_F32_TO_FXPANGLE(0.62833160243401f),
    IFX_LUT_F32_TO_FXPANGLE(0.628970461982645f),
    IFX_LUT_F32_TO_FXPANGLE(0.62960872820511f),
    IFX_LUT_F32_TO_FXPANGLE(0.630246401408263f),
    IFX_LUT_F32_TO_FXPANGLE(0.630883481900322f),
    IFX_LUT_F32_TO_FXPANGLE(0.631519969990857f),
    IFX_LUT_F32_TO_FXPANGLE(0.632155865990784f),
    IFX_LUT_F32_TO_FXPANGLE(0.632791170212352f),
    IFX_LUT_F32_TO_FXPANGLE(0.633425882969145f),
    IFX_LUT_F32_TO_FXPANGLE(0.634060004576065f),
    IFX_LUT_F32_TO_FXPANGLE(0.634693535349333f),
    IFX_LUT_F32_TO_FXPANGLE(0.635326475606475f),
    IFX_LUT_F32_TO_FXPANGLE(0.635958825666321f),
    IFX_LUT_F32_TO_FXPANGLE(0.636590585848993f),
    IFX_LUT_F32_TO_FXPANGLE(0.637221756475899f),
    IFX_LUT_F32_TO_FXPANGLE(0.637852337869727f),
    IFX_LUT_F32_TO_FXPANGLE(0.638482330354438f),
    IFX_LUT_F32_TO_FXPANGLE(0.639111734255255f),
    IFX_LUT_F32_TO_FXPANGLE(0.639740549898664f),
    IFX_LUT_F32_TO_FXPANGLE(0.640368777612397f),
    IFX_LUT_F32_TO_FXPANGLE(0.640996417725432f),
    IFX_LUT_F32_TO_FXPANGLE(0.641623470567984f),
    IFX_LUT_F32_TO_FXPANGLE(0.642249936471496f),
    IFX_LUT_F32_TO_FXPANGLE(0.642875815768636f),
    IFX_LUT_F32_TO_FXPANGLE(0.643501108793284f),
    IFX_LUT_F32_TO_FXPANGLE(0.644125815880533f),
    IFX_LUT_F32_TO_FXPANGLE(0.644749937366675f),
    IFX_LUT_F32_TO_FXPANGLE(0.645373473589196f),
    IFX_LUT_F32_TO_FXPANGLE(0.645996424886772f),
    IFX_LUT_F32_TO_FXPANGLE(0.646618791599258f),
    IFX_LUT_F32_TO_FXPANGLE(0.647240574067683f),
    IFX_LUT_F32_TO_FXPANGLE(0.647861772634245f),
    IFX_LUT_F32_TO_FXPANGLE(0.648482387642301f),
    IFX_LUT_F32_TO_FXPANGLE(0.649102419436359f),
    IFX_LUT_F32_TO_FXPANGLE(0.649721868362078f),
    IFX_LUT_F32_TO_FXPANGLE(0.650340734766252f),
    IFX_LUT_F32_TO_FXPANGLE(0.650959018996812f),
    IFX_LUT_F32_TO_FXPANGLE(0.651576721402813f),
    IFX_LUT_F32_TO_FXPANGLE(0.652193842334429f),
    IFX_LUT_F32_TO_FXPANGLE(0.652810382142948f),
    IFX_LUT_F32_TO_FXPANGLE(0.653426341180762f),
    IFX_LUT_F32_TO_FXPANGLE(0.654041719801364f),
    IFX_LUT_F32_TO_FXPANGLE(0.65465651835934f),
    IFX_LUT_F32_TO_FXPANGLE(0.655270737210358f),
    IFX_LUT_F32_TO_FXPANGLE(0.655884376711171f),
    IFX_LUT_F32_TO_FXPANGLE(0.656497437219599f),
    IFX_LUT_F32_TO_FXPANGLE(0.657109919094532f),
    IFX_LUT_F32_TO_FXPANGLE(0.657721822695918f),
    IFX_LUT_F32_TO_FXPANGLE(0.658333148384756f),
    IFX_LUT_F32_TO_FXPANGLE(0.658943896523094f),
    IFX_LUT_F32_TO_FXPANGLE(0.659554067474019f),
    IFX_LUT_F32_TO_FXPANGLE(0.660163661601649f),
    IFX_LUT_F32_TO_FXPANGLE(0.660772679271133f),
    IFX_LUT_F32_TO_FXPANGLE(0.661381120848635f),
    IFX_LUT_F32_TO_FXPANGLE(0.661988986701338f),
    IFX_LUT_F32_TO_FXPANGLE(0.662596277197427f),
    IFX_LUT_F32_TO_FXPANGLE(0.663202992706093f),
    IFX_LUT_F32_TO_FXPANGLE(0.663809133597518f),
    IFX_LUT_F32_TO_FXPANGLE(0.664414700242873f),
    IFX_LUT_F32_TO_FXPANGLE(0.665019693014312f),
    IFX_LUT_F32_TO_FXPANGLE(0.665624112284961f),
    IFX_LUT_F32_TO_FXPANGLE(0.666227958428919f),
    IFX_LUT_F32_TO_FXPANGLE(0.666831231821246f),
    IFX_LUT_F32_TO_FXPANGLE(0.667433932837957f),
    IFX_LUT_F32_TO_FXPANGLE(0.66803606185602f),
    IFX_LUT_F32_TO_FXPANGLE(0.668637619253345f),
    IFX_LUT_F32_TO_FXPANGLE(0.66923860540878f),
    IFX_LUT_F32_TO_FXPANGLE(0.669839020702103f),
    IFX_LUT_F32_TO_FXPANGLE(0.670438865514021f),
    IFX_LUT_F32_TO_FXPANGLE(0.671038140226157f),
    IFX_LUT_F32_TO_FXPANGLE(0.671636845221047f),
    IFX_LUT_F32_TO_FXPANGLE(0.672234980882134f),
    IFX_LUT_F32_TO_FXPANGLE(0.672832547593763f),
    IFX_LUT_F32_TO_FXPANGLE(0.673429545741172f),
    IFX_LUT_F32_TO_FXPANGLE(0.674025975710487f),
    IFX_LUT_F32_TO_FXPANGLE(0.674621837888718f),
    IFX_LUT_F32_TO_FXPANGLE(0.67521713266375f),
    IFX_LUT_F32_TO_FXPANGLE(0.675811860424338f),
    IFX_LUT_F32_TO_FXPANGLE(0.676406021560103f),
    IFX_LUT_F32_TO_FXPANGLE(0.676999616461522f),
    IFX_LUT_F32_TO_FXPANGLE(0.677592645519925f),
    IFX_LUT_F32_TO_FXPANGLE(0.678185109127489f),
    IFX_LUT_F32_TO_FXPANGLE(0.678777007677231f),
    IFX_LUT_F32_TO_FXPANGLE(0.679368341563002f),
    IFX_LUT_F32_TO_FXPANGLE(0.679959111179482f),
    IFX_LUT_F32_TO_FXPANGLE(0.680549316922172f),
    IFX_LUT_F32_TO_FXPANGLE(0.681138959187393f),
    IFX_LUT_F32_TO_FXPANGLE(0.681728038372273f),
    IFX_LUT_F32_TO_FXPANGLE(0.682316554874748f),
    IFX_LUT_F32_TO_FXPANGLE(0.682904509093552f),
    IFX_LUT_F32_TO_FXPANGLE(0.683491901428213f),
    IFX_LUT_F32_TO_FXPANGLE(0.684078732279046f),
    IFX_LUT_F32_TO_FXPANGLE(0.684665002047149f),
    IFX_LUT_F32_TO_FXPANGLE(0.685250711134394f),
    IFX_LUT_F32_TO_FXPANGLE(0.685835859943427f),
    IFX_LUT_F32_TO_FXPANGLE(0.686420448877654f),
    IFX_LUT_F32_TO_FXPANGLE(0.687004478341245f),
    IFX_LUT_F32_TO_FXPANGLE(0.68758794873912f),
    IFX_LUT_F32_TO_FXPANGLE(0.688170860476949f),
    IFX_LUT_F32_TO_FXPANGLE(0.688753213961141f),
    IFX_LUT_F32_TO_FXPANGLE(0.689335009598846f),
    IFX_LUT_F32_TO_FXPANGLE(0.689916247797941f),
    IFX_LUT_F32_TO_FXPANGLE(0.69049692896703f),
    IFX_LUT_F32_TO_FXPANGLE(0.691077053515437f),
    IFX_LUT_F32_TO_FXPANGLE(0.6916566218532f),
    IFX_LUT_F32_TO_FXPANGLE(0.692235634391065f),
    IFX_LUT_F32_TO_FXPANGLE(0.692814091540483f),
    IFX_LUT_F32_TO_FXPANGLE(0.693391993713601f),
    IFX_LUT_F32_TO_FXPANGLE(0.69396934132326f),
    IFX_LUT_F32_TO_FXPANGLE(0.694546134782985f),
    IFX_LUT_F32_TO_FXPANGLE(0.695122374506987f),
    IFX_LUT_F32_TO_FXPANGLE(0.695698060910148f),
    IFX_LUT_F32_TO_FXPANGLE(0.696273194408024f),
    IFX_LUT_F32_TO_FXPANGLE(0.696847775416835f),
    IFX_LUT_F32_TO_FXPANGLE(0.697421804353461f),
    IFX_LUT_F32_TO_FXPANGLE(0.697995281635439f),
    IFX_LUT_F32_TO_FXPANGLE(0.69856820768095f),
    IFX_LUT_F32_TO_FXPANGLE(0.699140582908824f),
    IFX_LUT_F32_TO_FXPANGLE(0.699712407738527f),
    IFX_LUT_F32_TO_FXPANGLE(0.70028368259016f),
    IFX_LUT_F32_TO_FXPANGLE(0.70085440788445f),
    IFX_LUT_F32_TO_FXPANGLE(0.70142458404275f),
    IFX_LUT_F32_TO_FXPANGLE(0.701994211487028f),
    IFX_LUT_F32_TO_FXPANGLE(0.702563290639866f),
    IFX_LUT_F32_TO_FXPANGLE(0.703131821924454f),
    IFX_LUT_F32_TO_FXPANGLE(0.703699805764582f),
    IFX_LUT_F32_TO_FXPANGLE(0.704267242584639f),
    IFX_LUT_F32_TO_FXPANGLE(0.704834132809605f),
    IFX_LUT_F32_TO_FXPANGLE(0.705400476865049f),
    IFX_LUT_F32_TO_FXPANGLE(0.705966275177119f),
    IFX_LUT_F32_TO_FXPANGLE(0.706531528172541f),
    IFX_LUT_F32_TO_FXPANGLE(0.707096236278612f),
    IFX_LUT_F32_TO_FXPANGLE(0.707660399923198f),
    IFX_LUT_F32_TO_FXPANGLE(0.708224019534724f),
    IFX_LUT_F32_TO_FXPANGLE(0.708787095542173f),
    IFX_LUT_F32_TO_FXPANGLE(0.70934962837508f),
    IFX_LUT_F32_TO_FXPANGLE(0.709911618463525f),
    IFX_LUT_F32_TO_FXPANGLE(0.710473066238132f),
    IFX_LUT_F32_TO_FXPANGLE(0.711033972130061f),
    IFX_LUT_F32_TO_FXPANGLE(0.711594336571003f),
    IFX_LUT_F32_TO_FXPANGLE(0.712154159993179f),
    IFX_LUT_F32_TO_FXPANGLE(0.712713442829328f),
    IFX_LUT_F32_TO_FXPANGLE(0.713272185512711f),
    IFX_LUT_F32_TO_FXPANGLE(0.713830388477098f),
    IFX_LUT_F32_TO_FXPANGLE(0.714388052156769f),
    IFX_LUT_F32_TO_FXPANGLE(0.714945176986506f),
    IFX_LUT_F32_TO_FXPANGLE(0.715501763401588f),
    IFX_LUT_F32_TO_FXPANGLE(0.71605781183779f),
    IFX_LUT_F32_TO_FXPANGLE(0.716613322731375f),
    IFX_LUT_F32_TO_FXPANGLE(0.717168296519088f),
    IFX_LUT_F32_TO_FXPANGLE(0.717722733638155f),
    IFX_LUT_F32_TO_FXPANGLE(0.718276634526277f),
    IFX_LUT_F32_TO_FXPANGLE(0.718829999621625f),
    IFX_LUT_F32_TO_FXPANGLE(0.719382829362832f),
    IFX_LUT_F32_TO_FXPANGLE(0.719935124188996f),
    IFX_LUT_F32_TO_FXPANGLE(0.720486884539668f),
    IFX_LUT_F32_TO_FXPANGLE(0.721038110854852f),
    IFX_LUT_F32_TO_FXPANGLE(0.721588803574998f),
    IFX_LUT_F32_TO_FXPANGLE(0.722138963140998f),
    IFX_LUT_F32_TO_FXPANGLE(0.722688589994184f),
    IFX_LUT_F32_TO_FXPANGLE(0.723237684576318f),
    IFX_LUT_F32_TO_FXPANGLE(0.723786247329592f),
    IFX_LUT_F32_TO_FXPANGLE(0.724334278696622f),
    IFX_LUT_F32_TO_FXPANGLE(0.724881779120445f),
    IFX_LUT_F32_TO_FXPANGLE(0.725428749044511f),
    IFX_LUT_F32_TO_FXPANGLE(0.725975188912682f),
    IFX_LUT_F32_TO_FXPANGLE(0.726521099169226f),
    IFX_LUT_F32_TO_FXPANGLE(0.727066480258813f),
    IFX_LUT_F32_TO_FXPANGLE(0.727611332626511f),
    IFX_LUT_F32_TO_FXPANGLE(0.72815565671778f),
    IFX_LUT_F32_TO_FXPANGLE(0.72869945297847f),
    IFX_LUT_F32_TO_FXPANGLE(0.729242721854815f),
    IFX_LUT_F32_TO_FXPANGLE(0.729785463793429f),
    IFX_LUT_F32_TO_FXPANGLE(0.730327679241302f),
    IFX_LUT_F32_TO_FXPANGLE(0.730869368645794f),
    IFX_LUT_F32_TO_FXPANGLE(0.731410532454635f),
    IFX_LUT_F32_TO_FXPANGLE(0.731951171115917f),
    IFX_LUT_F32_TO_FXPANGLE(0.732491285078088f),
    IFX_LUT_F32_TO_FXPANGLE(0.733030874789955f),
    IFX_LUT_F32_TO_FXPANGLE(0.733569940700672f),
    IFX_LUT_F32_TO_FXPANGLE(0.73410848325974f),
    IFX_LUT_F32_TO_FXPANGLE(0.734646502917002f),
    IFX_LUT_F32_TO_FXPANGLE(0.73518400012264f),
    IFX_LUT_F32_TO_FXPANGLE(0.735720975327167f),
    IFX_LUT_F32_TO_FXPANGLE(0.736257428981428f),
    IFX_LUT_F32_TO_FXPANGLE(0.736793361536592f),
    IFX_LUT_F32_TO_FXPANGLE(0.737328773444149f),
