Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Service/CpuGeneric/SysSe/Math/Ifx_LutAtan2F32_Table.c
 0.704267242584639f,   0.704834132809605f,    0.705400476865049f,   0.705966275177119f,   0.706531528172541f,   0.707096236278612f,   0.707660399923198f,   0.708224019534724f,   0.708787095542173f,   0.70934962837508f,
 0.709911618463525f,   0.710473066238132f,    0.711033972130061f,   0.711594336571003f,   0.712154159993179f,   0.712713442829328f,   0.713272185512711f,   0.713830388477098f,   0.714388052156769f,   0.714945176986506f,
 0.715501763401588f,   0.71605781183779f,     0.716613322731375f,   0.717168296519088f,   0.717722733638155f,   0.718276634526277f,   0.718829999621625f,   0.719382829362832f,   0.719935124188996f,   0.720486884539668f,
 0.721038110854852f,   0.721588803574998f,    0.722138963140998f,   0.722688589994184f,   0.723237684576318f,   0.723786247329592f,   0.724334278696622f,   0.724881779120445f,   0.725428749044511f,   0.725975188912682f,
 0.726521099169226f,   0.727066480258813f,    0.727611332626511f,   0.72815565671778f,    0.72869945297847f,    0.729242721854815f,   0.729785463793429f,   0.730327679241302f,   0.730869368645794f,   0.731410532454635f,
 0.731951171115917f,   0.732491285078088f,    0.733030874789955f,   0.733569940700672f,   0.73410848325974f,    0.734646502917002f,   0.73518400012264f,    0.735720975327167f,   0.736257428981428f,   0.736793361536592f,
 0.737328773444149f,   0.737863665155908f,    0.73839803712399f,    0.738931889800823f,   0.739465223639145f,   0.73999803909199f,    0.740530336612693f,   0.741062116654879f,   0.741593379672465f,   0.74212412611965f,
 0.742654356450918f,   0.743184071121027f,    0.74371327058501f,    0.74424195529817f,    0.744770125716075f,   0.745297782294555f,   0.745824925489697f,   0.746351555757843f,   0.746877673555588f,   0.747403279339768f,
 0.747928373567467f,   0.748452956696006f,    0.748977029182941f,   0.749500591486061f,   0.750023644063381f,   0.750546187373141f,   0.751068221873802f,   0.751589748024043f,   0.752110766282754f,   0.752631277109036f,
 0.753151280962194f,   0.75367077830174f,     0.754189769587379f,   0.754708255279016f,   0.755226235836745f,   0.755743711720849f,   0.756260683391796f,   0.756777151310235f,   0.757293115936992f,   0.757808577733069f,
 0.758323537159635f,   0.758837994678031f,    0.759351950749758f,   0.75986540583648f,    0.760378360400016f,   0.760890814902341f,   0.761402769805578f,   0.761914225571999f,   0.762425182664017f,   0.762935641544187f,
 0.763445602675202f,   0.763955066519886f,    0.764464033541195f,   0.764972504202212f,   0.765480478966144f,   0.765987958296319f,   0.766494942656179f,   0.767001432509286f,   0.767507428319308f,   0.768012930550024f,
 0.768517939665315f,   0.769022456129166f,    0.769526480405658f,   0.77003001295897f,    0.770533054253371f,   0.771035604753219f,   0.77153766492296f,    0.77203923522712f,    0.772540316130307f,   0.773040908097206f,
 0.773541011592573f,   0.774040627081239f,    0.7745397550281f,     0.775038395898116f,   0.775536550156312f,   0.776034218267768f,   0.776531400697624f,   0.77702809791107f,    0.777524310373348f,   0.778020038549745f,
 0.778515282905595f,   0.779010043906271f,    0.779504322017186f,   0.77999811770379f,    0.780491431431562f,   0.780984263666015f,   0.781476614872688f,   0.781968485517144f,   0.782459876064968f,   0.782950786981764f,
 0.783441218733152f,   0.783931171784766f,    0.784420646602251f,   0.784909643651259f,   0.785398163397448f};
